""" Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

Пример:

- [1.1, 1.2, 3.1, 5, 10.01] => 0.19 """
import math
n = int(input())
arr = list()
for i in range(n):
    arr.append(float(input()))
arr_count = list
for i in range(n):
    print(arr_count(arr-math.floor(arr)))




